tenant_template_esbinput/api_deploy/api__deploy__tenant__deleteApp.xml

<@pp.dropOutputFile />
<@pp.changeOutputFile name="api__deploy__"+tenant.code+"__deleteApp.xml"/>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mgt="http://mgt.application.carbon.wso2.org">
   <soapenv:Header/>
   <soapenv:Body>
      <mgt:deleteApplication>
         <!--Optional:-->
         <mgt:appName>${tenant.code}_inputeventscap_1.0.0</mgt:appName>
      </mgt:deleteApplication>
   </soapenv:Body>
</soapenv:Envelope>