tenant_template_esbinput/api_deploy/api__deploy__tenant__listAllApplications.xml

<@pp.dropOutputFile />
<@pp.changeOutputFile name="api__deploy__"+tenant.code+"__listAllApplications.xml"/>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mgt="http://mgt.application.carbon.wso2.org">
   <soapenv:Header/>
   <soapenv:Body>
      <mgt:listAllApplications/>
   </soapenv:Body>
</soapenv:Envelope>